# Data Extraction with Pivot Tables

Source code from the article [Data Extraction with Pandas](https://medium.com/analytics-vidhya/data-extraction-with-pivot-tables-a7d980c18dd0) written
by Thiyari Sai Manikanth.

In [2]:
import pandas as pd
import numpy as np

## Example 1 (Single index)

In [8]:
df = pd.read_excel("D:\\github\\\data-science-playground\\source\\pandas\\Drugs.xlsx")

data = pd.pivot_table(df, index=["Patient Name"])

data

                                Cost  Serial     Units
Patient Name
Barton LLC                     35000  740150  1.000000
Fritsch, Russel and Anderson   35000  737550  1.000000
Herman LLC                     65000  141962  2.000000
Jerde-Hilpert                   5000  412290  2.000000
Kassulke, Ondricka and Metz     7000  307599  3.000000
Keeling LLC                   100000  688981  5.000000
Kiehn-Spinka                   65000  146832  2.000000
Koepp Ltd                      35000  729833  2.000000
Kulas Inc                      25000  218895  1.500000
Purdy-Kunde                    30000  163416  1.000000
Stokes LLC                      7500  239344  1.000000
Trantow-Barrows                15000  714466  1.333333

## Example 2 (Multiple indexes)

In [13]:
data = pd.pivot_table(df, index=["Patient Name", "Jr Doctor", "Sr Doctor"])

pd.set_option('display.max_columns', None)

data

,,,Cost,Serial,Units
Patient Name,Jr Doctor,Sr Doctor,,,
Barton LLC,John Smith,Debra Henley,35000,740150,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,35000,737550,1.000000
Herman LLC,Cedric Moss,Fred Anderson,65000,141962,2.000000
Jerde-Hilpert,John Smith,Debra Henley,5000,412290,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,7000,307599,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,100000,688981,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,65000,146832,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,35000,729833,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,25000,218895,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,30000,163416,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,7500,239344,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,15000,714466,1.333333

## Example 3

In [14]:

data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Units"])

pd.set_option('display.max_columns', None)

data

                                Units
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker   1.250000
              Daniel Hilton  1.666667
              John Smith     1.500000
Fred Anderson Cedric Moss    1.250000
              Wendy Yule     3.000000

## Example 4 (Aggregation functions)

In [18]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Cost"], aggfunc=np.sum)

pd.set_option('display.max_columns', None)

data

                               Cost
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

## Example 5 (More aggregation functions)

In [20]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Cost"], aggfunc=[np.sum, len])

pd.set_option('display.max_columns', None)

data

                                sum  len
                               Cost Cost
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker    80000    4
              Daniel Hilton  115000    3
              John Smith      40000    2
Fred Anderson Cedric Moss    110000    4
              Wendy Yule     177000    4

## Example 6 (Aggregation functions using columns)

In [23]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Cost"], \
                      columns=["Drug"], aggfunc=[np.sum])

pd.set_option('display.max_columns', None)

data

                                    sum
                                   Cost
Drug                        Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker       5000.0     NaN   65000.0    10000.0
              Daniel Hilton         NaN     NaN  105000.0    10000.0
              John Smith         5000.0     NaN   35000.0        NaN
Fred Anderson Cedric Moss        5000.0     NaN   95000.0    10000.0
              Wendy Yule         7000.0  5000.0  165000.0        NaN

## Example 7 (Using fill values for Nan values)

In [24]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Cost"], \
                      columns=["Drug"], aggfunc=[np.sum], fill_value=0)

pd.set_option('display.max_columns', None)

data

                                    sum
                                   Cost
Drug                        Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker         5000       0     65000      10000
              Daniel Hilton           0       0    105000      10000
              John Smith           5000       0     35000          0
Fred Anderson Cedric Moss          5000       0     95000      10000
              Wendy Yule           7000    5000    165000          0

## Example 8 (Using multiple values)

In [25]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor"], values=["Cost", "Units"], \
                      columns=["Drug"], aggfunc=[np.sum], fill_value=0)

pd.set_option('display.max_columns', None)

data

                                    sum                               \
                                   Cost
Drug                        Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker         5000       0     65000      10000
              Daniel Hilton           0       0    105000      10000
              John Smith           5000       0     35000          0
Fred Anderson Cedric Moss          5000       0     95000      10000
              Wendy Yule           7000    5000    165000          0


                                  Units
Drug                        Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Jr Doctor
Debra Henley  Craig Booker            2       0         2          1
              Daniel Hilton           0       0         4          1
              John Smith              2       0         1          0
Fred Anderson Cedric Moss             1       0         3          1
              Wendy Yule              3       2         7          0

### Example 9 (Adding "Drug" to the index)

In [27]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor", "Drug"], values=["Cost", "Units"],
                      aggfunc=[np.sum], fill_value=0)

pd.set_option('display.max_columns', None)

data

                                            sum
                                           Cost Units
Sr Doctor     Jr Doctor     Drug
Debra Henley  Craig Booker  Amphetamine    5000     2
                            Mescaline     65000     2
                            Psilocybin    10000     1
              Daniel Hilton Mescaline    105000     4
                            Psilocybin    10000     1
              John Smith    Amphetamine    5000     2
                            Mescaline     35000     1
Fred Anderson Cedric Moss   Amphetamine    5000     1
                            Mescaline     95000     3
                            Psilocybin    10000     1
              Wendy Yule    Amphetamine    7000     3
                            Aptivus        5000     2
                            Mescaline    165000     7

### Example 10 (margins=True)

In [29]:
data = pd.pivot_table(df, index=["Sr Doctor", "Jr Doctor", "Drug"], values=["Cost", "Units"],
                      aggfunc=[np.sum, np.mean], fill_value=0, margins=True)

pd.set_option('display.max_columns', None)

data

                                            sum                mean
                                           Cost Units          Cost     Units
Sr Doctor     Jr Doctor     Drug
Debra Henley  Craig Booker  Amphetamine    5000     2   5000.000000  2.000000
                            Mescaline     65000     2  32500.000000  1.000000
                            Psilocybin    10000     1  10000.000000  1.000000
              Daniel Hilton Mescaline    105000     4  52500.000000  2.000000
                            Psilocybin    10000     1  10000.000000  1.000000
              John Smith    Amphetamine    5000     2   5000.000000  2.000000
                            Mescaline     35000     1  35000.000000  1.000000
Fred Anderson Cedric Moss   Amphetamine    5000     1   5000.000000  1.000000
                            Mescaline     95000     3  47500.000000  1.500000
                            Psilocybin    10000     1  10000.000000  1.000000
              Wendy Yule    Amphetamine    7000     3   7000.000000  3.000000
                            Aptivus        5000     2   5000.000000  2.000000
                            Mescaline    165000     7  82500.000000  3.500000
All                                      522000    30  30705.882353  1.764706

## Example 11 (Track Sr. Doctor level)

In [31]:
data = pd.pivot_table(df, index=["Sr Doctor", "Outcome"], values=["Cost"],
                      aggfunc=[np.sum], fill_value=0, margins=True)

pd.set_option('display.max_columns', None)

data

                                      sum
                                     Cost
Sr Doctor     Outcome
Debra Henley  condition improved    50000
              condition unchanged   65000
              not reported          70000
              recovered             50000
Fred Anderson condition improved     5000
              condition unchanged  172000
              not reported          65000
              recovered             45000
All                                522000

## Example 12 (Using a dictionary of agg functions - 1)

In [32]:
data = pd.pivot_table(df, index=["Sr Doctor", "Outcome"], columns=["Drug"], values=["Units", "Cost"],
                      aggfunc={"Units": len, "Cost": np.sum}, fill_value=0)

pd.set_option('display.max_columns', None)

data

                                         Cost                               \
Drug                              Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Outcome
Debra Henley  condition improved        10000       0     40000          0
              condition unchanged           0       0     65000          0
              not reported                  0       0     70000          0
              recovered                     0       0     30000      20000
Fred Anderson condition improved         5000       0         0          0
              condition unchanged        7000       0    165000          0
              not reported                  0       0     65000          0
              recovered                     0    5000     30000      10000

                                        Units
Drug                              Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Outcome
Debra Henley  condition improved            2       0         1          0
              condition unchanged           0       0         1          0
              not reported                  0       0         2          0
              recovered                     0       0         1          2
Fred Anderson condition improved            1       0         0          0
              condition unchanged           1       0         2          0
              not reported                  0       0         1          0
              recovered                     0       1         1          1

## Example 13 (Using a dictionary of agg functions - 2)

In [33]:
data = pd.pivot_table(df, index=["Sr Doctor", "Outcome"], columns=["Drug"], values=["Units", "Cost"],
                      aggfunc={"Units": len, "Cost": [np.sum, np.mean]}, fill_value=0)

pd.set_option('display.max_columns', None)

data

                                         Cost                               \
                                         mean
Drug                              Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Outcome
Debra Henley  condition improved         5000       0     40000          0
              condition unchanged           0       0     65000          0
              not reported                  0       0     35000          0
              recovered                     0       0     30000      10000
Fred Anderson condition improved         5000       0         0          0
              condition unchanged        7000       0     82500          0
              not reported                  0       0     65000          0
              recovered                     0    5000     30000      10000

                                                                            \
                                          sum
Drug                              Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Outcome
Debra Henley  condition improved        10000       0     40000          0
              condition unchanged           0       0     65000          0
              not reported                  0       0     70000          0
              recovered                     0       0     30000      20000
Fred Anderson condition improved         5000       0         0          0
              condition unchanged        7000       0    165000          0
              not reported                  0       0     65000          0
              recovered                     0    5000     30000      10000

                                        Units
                                          len
Drug                              Amphetamine Aptivus Mescaline Psilocybin
Sr Doctor     Outcome
Debra Henley  condition improved            2       0         1          0
              condition unchanged           0       0         1          0
              not reported                  0       0         2          0
              recovered                     0       0         1          2
Fred Anderson condition improved            1       0         0          0
              condition unchanged           1       0         2          0
              not reported                  0       0         1          0
              recovered                     0       1         1          1